hideyuki/IIS2DLPC-I2C-ESP32/src/iis2dlpc_reg.h
#define IIS2DLPC_OUT_X_L                     0x28U
#define IIS2DLPC_OUT_X_H                     0x29U
#define IIS2DLPC_OUT_Y_L                     0x2AU
#define IIS2DLPC_OUT_Y_H                     0x2BU
#define IIS2DLPC_OUT_Z_L                     0x2CU
#define IIS2DLPC_OUT_Z_H                     0x2DU
#define IIS2DLPC_FIFO_CTRL                   0x2EU
typedef struct {
  uint8_t fth                        : 5;
  uint8_t fmode                      : 3;
} iis2dlpc_fifo_ctrl_t;

#define IIS2DLPC_FIFO_SAMPLES                0x2FU
typedef struct {
  uint8_t diff                       : 6;
  uint8_t fifo_ovr                   : 1;
  uint8_t fifo_fth                   : 1;
} iis2dlpc_fifo_samples_t;

#define IIS2DLPC_TAP_THS_X                   0x30U
typedef struct {
  uint8_t tap_thsx                    : 5;
  uint8_t _6d_ths                     : 2;
  uint8_t _4d_en                      : 1;
} iis2dlpc_tap_ths_x_t;

#define IIS2DLPC_TAP_THS_Y                   0x31U
typedef struct {
  uint8_t tap_thsy                   : 5;
  uint8_t tap_prior                  : 3;
} iis2dlpc_tap_ths_y_t;

#define IIS2DLPC_TAP_THS_Z                   0x32U
typedef struct {
  uint8_t tap_thsz                   : 5;
  uint8_t tap_z_en                   : 1;
  uint8_t tap_y_en                   : 1;
  uint8_t tap_x_en                   : 1;
} iis2dlpc_tap_ths_z_t;

#define IIS2DLPC_INT_DUR                     0x33U
typedef struct {
  uint8_t shock                      : 2;
  uint8_t quiet                      : 2;
  uint8_t latency                    : 4;
} iis2dlpc_int_dur_t;

#define IIS2DLPC_WAKE_UP_THS                 0x34U
typedef struct {
  uint8_t wk_ths                     : 6;
  uint8_t sleep_on                   : 1;
  uint8_t single_double_tap          : 1;
} iis2dlpc_wake_up_ths_t;

#define IIS2DLPC_WAKE_UP_DUR                 0x35U
typedef struct {
  uint8_t sleep_dur                  : 4;
  uint8_t stationary                 : 1;
  uint8_t wake_dur                   : 2;
  uint8_t ff_dur                     : 1;
} iis2dlpc_wake_up_dur_t;

#define IIS2DLPC_FREE_FALL                   0x36U
typedef struct {
  uint8_t ff_ths                     : 3;
  uint8_t ff_dur                     : 5;
} iis2dlpc_free_fall_t;

#define IIS2DLPC_STATUS_DUP                  0x37U
typedef struct {
  uint8_t drdy                       : 1;
  uint8_t ff_ia                      : 1;
  uint8_t _6d_ia                     : 1;
  uint8_t single_tap                 : 1;
  uint8_t double_tap                 : 1;
  uint8_t sleep_state_ia             : 1;
  uint8_t drdy_t                     : 1;
  uint8_t ovr                        : 1;
} iis2dlpc_status_dup_t;

#define IIS2DLPC_WAKE_UP_SRC                 0x38U
typedef struct {
  uint8_t z_wu                       : 1;
  uint8_t y_wu                       : 1;
  uint8_t x_wu                       : 1;
  uint8_t wu_ia                      : 1;
  uint8_t sleep_state_ia             : 1;
  uint8_t ff_ia                      : 1;
  uint8_t not_used_01                : 2;
} iis2dlpc_wake_up_src_t;

#define IIS2DLPC_TAP_SRC                     0x39U
typedef struct {
  uint8_t z_tap                      : 1;
  uint8_t y_tap                      : 1;
  uint8_t x_tap                      : 1;
  uint8_t tap_sign                   : 1;
  uint8_t double_tap                 : 1;
  uint8_t single_tap                 : 1;
  uint8_t tap_ia                     : 1;
  uint8_t not_used_01                : 1;
} iis2dlpc_tap_src_t;

#define IIS2DLPC_SIXD_SRC                    0x3AU
typedef struct {
  uint8_t xl                         : 1;
  uint8_t xh                         : 1;
  uint8_t yl                         : 1;
  uint8_t yh                         : 1;
  uint8_t zl                         : 1;
  uint8_t zh                         : 1;
  uint8_t _6d_ia                     : 1;
  uint8_t not_used_01                : 1;
} iis2dlpc_sixd_src_t;

#define IIS2DLPC_ALL_INT_SRC                 0x3BU
typedef struct {
  uint8_t ff_ia                      : 1;
  uint8_t wu_ia                      : 1;
  uint8_t single_tap                 : 1;
  uint8_t double_tap                 : 1;
  uint8_t _6d_ia                     : 1;
  uint8_t sleep_change_ia            : 1;
  uint8_t not_used_01                : 2;
} iis2dlpc_all_int_src_t;

#define IIS2DLPC_X_OFS_USR                   0x3CU
#define IIS2DLPC_Y_OFS_USR                   0x3DU
#define IIS2DLPC_Z_OFS_USR                   0x3EU
#define IIS2DLPC_CTRL7                       0x3FU
typedef struct {
  uint8_t lpass_on6d                 : 1;
  uint8_t hp_ref_mode                : 1;
  uint8_t usr_off_w                  : 1;
  uint8_t usr_off_on_wu              : 1;
  uint8_t usr_off_on_out             : 1;
  uint8_t interrupts_enable          : 1;
  uint8_t int2_on_int1               : 1;
  uint8_t drdy_pulsed                : 1;
} iis2dlpc_ctrl7_t;

/**
  * @defgroup IIS2DLPC_Register_Union
  * @brief    This union group all the registers that has a bitfield
  *           description.
  *           This union is usefull but not need by the driver.
  *
  *           REMOVING this union you are complient with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union {
  iis2dlpc_ctrl1_t                   ctrl1;
  iis2dlpc_ctrl2_t                   ctrl2;
  iis2dlpc_ctrl3_t                   ctrl3;
  iis2dlpc_ctrl4_int1_pad_ctrl_t     ctrl4_int1_pad_ctrl;
  iis2dlpc_ctrl5_int2_pad_ctrl_t     ctrl5_int2_pad_ctrl;
  iis2dlpc_ctrl6_t                   ctrl6;
  iis2dlpc_status_t                  status;
  iis2dlpc_fifo_ctrl_t               fifo_ctrl;
  iis2dlpc_fifo_samples_t            fifo_samples;
  iis2dlpc_tap_ths_x_t               tap_ths_x;
  iis2dlpc_tap_ths_y_t               tap_ths_y;
  iis2dlpc_tap_ths_z_t               tap_ths_z;
  iis2dlpc_int_dur_t                 int_dur;
  iis2dlpc_wake_up_ths_t             wake_up_ths;
  iis2dlpc_wake_up_dur_t             wake_up_dur;
  iis2dlpc_free_fall_t               free_fall;
  iis2dlpc_status_dup_t              status_dup;
  iis2dlpc_wake_up_src_t             wake_up_src;
  iis2dlpc_tap_src_t                 tap_src;
  iis2dlpc_sixd_src_t                sixd_src;
  iis2dlpc_all_int_src_t             all_int_src;
  iis2dlpc_ctrl7_t                   ctrl7;
  bitwise_t                          bitwise;
  uint8_t                            byte;
} iis2dlpc_reg_t;

/**
  * @}
  *
  */

int32_t iis2dlpc_read_reg(iis2dlpc_ctx_t *ctx, uint8_t reg, uint8_t *data,
                          uint16_t len);
int32_t iis2dlpc_write_reg(iis2dlpc_ctx_t *ctx, uint8_t reg, uint8_t *data,
                           uint16_t len);

extern float_t iis2dlpc_from_fs2_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_fs4_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_fs8_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_fs16_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_fs2_lp1_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_fs4_lp1_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_fs8_lp1_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_fs16_lp1_to_mg(int16_t lsb);
extern float_t iis2dlpc_from_lsb_to_celsius(int16_t lsb);

