hideyuki/IIS2DLPC-I2C-ESP32/src/iis2dlpc_reg.h
typedef enum {
  IIS2DLPC_HIGH_PERFORMANCE                    = 0x04,
  IIS2DLPC_CONT_LOW_PWR_4                      = 0x03,
  IIS2DLPC_CONT_LOW_PWR_3                      = 0x02,
  IIS2DLPC_CONT_LOW_PWR_2                      = 0x01,
  IIS2DLPC_CONT_LOW_PWR_12bit                  = 0x00,
  IIS2DLPC_SINGLE_LOW_PWR_4                    = 0x0B,
  IIS2DLPC_SINGLE_LOW_PWR_3                    = 0x0A,
  IIS2DLPC_SINGLE_LOW_PWR_2                    = 0x09,
  IIS2DLPC_SINGLE_LOW_PWR_12bit                = 0x08,
  IIS2DLPC_HIGH_PERFORMANCE_LOW_NOISE          = 0x14,
  IIS2DLPC_CONT_LOW_PWR_LOW_NOISE_4            = 0x13,
  IIS2DLPC_CONT_LOW_PWR_LOW_NOISE_3            = 0x12,
  IIS2DLPC_CONT_LOW_PWR_LOW_NOISE_2            = 0x11,
  IIS2DLPC_CONT_LOW_PWR_LOW_NOISE_12bit        = 0x10,
  IIS2DLPC_SINGLE_LOW_PWR_LOW_NOISE_4          = 0x1B,
  IIS2DLPC_SINGLE_LOW_PWR_LOW_NOISE_3          = 0x1A,
  IIS2DLPC_SINGLE_LOW_PWR_LOW_NOISE_2          = 0x19,
  IIS2DLPC_SINGLE_LOW_LOW_NOISE_PWR_12bit      = 0x18,
} iis2dlpc_mode_t;
int32_t iis2dlpc_power_mode_set(iis2dlpc_ctx_t *ctx, iis2dlpc_mode_t val);
int32_t iis2dlpc_power_mode_get(iis2dlpc_ctx_t *ctx, iis2dlpc_mode_t *val);

typedef enum {
  IIS2DLPC_XL_ODR_OFF            = 0x00,
  IIS2DLPC_XL_ODR_1Hz6_LP_ONLY   = 0x01,
  IIS2DLPC_XL_ODR_12Hz5          = 0x02,
  IIS2DLPC_XL_ODR_25Hz           = 0x03,
  IIS2DLPC_XL_ODR_50Hz           = 0x04,
  IIS2DLPC_XL_ODR_100Hz          = 0x05,
  IIS2DLPC_XL_ODR_200Hz          = 0x06,
  IIS2DLPC_XL_ODR_400Hz          = 0x07,
  IIS2DLPC_XL_ODR_800Hz          = 0x08,
  IIS2DLPC_XL_ODR_1k6Hz          = 0x09,
  IIS2DLPC_XL_SET_SW_TRIG        = 0x12,  /* Use this only in SINGLE mode */
  IIS2DLPC_XL_SET_PIN_TRIG       = 0x22,  /* Use this only in SINGLE mode */
} iis2dlpc_odr_t;
int32_t iis2dlpc_data_rate_set(iis2dlpc_ctx_t *ctx, iis2dlpc_odr_t val);
int32_t iis2dlpc_data_rate_get(iis2dlpc_ctx_t *ctx, iis2dlpc_odr_t *val);

int32_t iis2dlpc_block_data_update_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_block_data_update_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_2g     = 0,
  IIS2DLPC_4g     = 1,
  IIS2DLPC_8g     = 2,
  IIS2DLPC_16g    = 3,
} iis2dlpc_fs_t;
int32_t iis2dlpc_full_scale_set(iis2dlpc_ctx_t *ctx, iis2dlpc_fs_t val);
int32_t iis2dlpc_full_scale_get(iis2dlpc_ctx_t *ctx, iis2dlpc_fs_t *val);

int32_t iis2dlpc_status_reg_get(iis2dlpc_ctx_t *ctx, iis2dlpc_status_t *val);

int32_t iis2dlpc_flag_data_ready_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef struct {
  iis2dlpc_status_dup_t   status_dup;
  iis2dlpc_wake_up_src_t  wake_up_src;
  iis2dlpc_tap_src_t      tap_src;
  iis2dlpc_sixd_src_t     sixd_src;
  iis2dlpc_all_int_src_t  all_int_src;
} iis2dlpc_all_sources_t;
int32_t iis2dlpc_all_sources_get(iis2dlpc_ctx_t *ctx,
                                 iis2dlpc_all_sources_t *val);

int32_t iis2dlpc_usr_offset_x_set(iis2dlpc_ctx_t *ctx, uint8_t *buff);
int32_t iis2dlpc_usr_offset_x_get(iis2dlpc_ctx_t *ctx, uint8_t *buff);

int32_t iis2dlpc_usr_offset_y_set(iis2dlpc_ctx_t *ctx, uint8_t *buff);
int32_t iis2dlpc_usr_offset_y_get(iis2dlpc_ctx_t *ctx, uint8_t *buff);

int32_t iis2dlpc_usr_offset_z_set(iis2dlpc_ctx_t *ctx, uint8_t *buff);
int32_t iis2dlpc_usr_offset_z_get(iis2dlpc_ctx_t *ctx, uint8_t *buff);

typedef enum {
  IIS2DLPC_LSb_977ug    = 0,
  IIS2DLPC_LSb_15mg6    = 1,
} iis2dlpc_usr_off_w_t;
int32_t iis2dlpc_offset_weight_set(iis2dlpc_ctx_t *ctx,
                                   iis2dlpc_usr_off_w_t val);
int32_t iis2dlpc_offset_weight_get(iis2dlpc_ctx_t *ctx,
                                   iis2dlpc_usr_off_w_t *val);

int32_t iis2dlpc_temperature_raw_get(iis2dlpc_ctx_t *ctx, uint8_t *buff);

int32_t iis2dlpc_acceleration_raw_get(iis2dlpc_ctx_t *ctx, uint8_t *buff);

int32_t iis2dlpc_device_id_get(iis2dlpc_ctx_t *ctx, uint8_t *buff);

int32_t iis2dlpc_auto_increment_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_auto_increment_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_reset_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_reset_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_boot_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_boot_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_XL_ST_DISABLE      = 0,
  IIS2DLPC_XL_ST_POSITIVE     = 1,
  IIS2DLPC_XL_ST_NEGATIVE     = 2,
} iis2dlpc_st_t;
int32_t iis2dlpc_self_test_set(iis2dlpc_ctx_t *ctx, iis2dlpc_st_t val);
int32_t iis2dlpc_self_test_get(iis2dlpc_ctx_t *ctx, iis2dlpc_st_t *val);

typedef enum {
  IIS2DLPC_DRDY_LATCHED   = 0,
  IIS2DLPC_DRDY_PULSED    = 1,
} iis2dlpc_drdy_pulsed_t;
int32_t iis2dlpc_data_ready_mode_set(iis2dlpc_ctx_t *ctx,
                                     iis2dlpc_drdy_pulsed_t val);
int32_t iis2dlpc_data_ready_mode_get(iis2dlpc_ctx_t *ctx,
                                     iis2dlpc_drdy_pulsed_t *val);

typedef enum {
  IIS2DLPC_LPF_ON_OUT         = 0x00,
  IIS2DLPC_USER_OFFSET_ON_OUT  = 0x01,
  IIS2DLPC_HIGH_PASS_ON_OUT    = 0x10,
} iis2dlpc_fds_t;
int32_t iis2dlpc_filter_path_set(iis2dlpc_ctx_t *ctx, iis2dlpc_fds_t val);
int32_t iis2dlpc_filter_path_get(iis2dlpc_ctx_t *ctx, iis2dlpc_fds_t *val);

typedef enum {
  IIS2DLPC_ODR_DIV_2     = 0,
  IIS2DLPC_ODR_DIV_4     = 1,
  IIS2DLPC_ODR_DIV_10    = 2,
  IIS2DLPC_ODR_DIV_20    = 3,
} iis2dlpc_bw_filt_t;
int32_t iis2dlpc_filter_bandwidth_set(iis2dlpc_ctx_t *ctx,
                                      iis2dlpc_bw_filt_t val);
int32_t iis2dlpc_filter_bandwidth_get(iis2dlpc_ctx_t *ctx,
                                      iis2dlpc_bw_filt_t *val);

int32_t iis2dlpc_reference_mode_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_reference_mode_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_SPI_4_WIRE   = 0,
  IIS2DLPC_SPI_3_WIRE   = 1,
} iis2dlpc_sim_t;
int32_t iis2dlpc_spi_mode_set(iis2dlpc_ctx_t *ctx, iis2dlpc_sim_t val);
int32_t iis2dlpc_spi_mode_get(iis2dlpc_ctx_t *ctx, iis2dlpc_sim_t *val);

typedef enum {
  IIS2DLPC_I2C_ENABLE    = 0,
  IIS2DLPC_I2C_DISABLE   = 1,
} iis2dlpc_i2c_disable_t;
int32_t iis2dlpc_i2c_interface_set(iis2dlpc_ctx_t *ctx,
                                   iis2dlpc_i2c_disable_t val);
int32_t iis2dlpc_i2c_interface_get(iis2dlpc_ctx_t *ctx,
                                   iis2dlpc_i2c_disable_t *val);

