hideyuki/IIS2DLPC-I2C-ESP32/src/iis2dlpc_reg.h
typedef enum {
  IIS2DLPC_PULL_UP_CONNECT     = 0,
  IIS2DLPC_PULL_UP_DISCONNECT  = 1,
} iis2dlpc_cs_pu_disc_t;
int32_t iis2dlpc_cs_mode_set(iis2dlpc_ctx_t *ctx, iis2dlpc_cs_pu_disc_t val);
int32_t iis2dlpc_cs_mode_get(iis2dlpc_ctx_t *ctx, iis2dlpc_cs_pu_disc_t *val);

typedef enum {
  IIS2DLPC_ACTIVE_HIGH  = 0,
  IIS2DLPC_ACTIVE_LOW   = 1,
} iis2dlpc_h_lactive_t;
int32_t iis2dlpc_pin_polarity_set(iis2dlpc_ctx_t *ctx,
                                  iis2dlpc_h_lactive_t val);
int32_t iis2dlpc_pin_polarity_get(iis2dlpc_ctx_t *ctx,
                                  iis2dlpc_h_lactive_t *val);

typedef enum {
  IIS2DLPC_INT_PULSED   = 0,
  IIS2DLPC_INT_LATCHED  = 1,
} iis2dlpc_lir_t;
int32_t iis2dlpc_int_notification_set(iis2dlpc_ctx_t *ctx,
                                      iis2dlpc_lir_t val);
int32_t iis2dlpc_int_notification_get(iis2dlpc_ctx_t *ctx,
                                      iis2dlpc_lir_t *val);

typedef enum {
  IIS2DLPC_PUSH_PULL   = 0,
  IIS2DLPC_OPEN_DRAIN  = 1,
} iis2dlpc_pp_od_t;
int32_t iis2dlpc_pin_mode_set(iis2dlpc_ctx_t *ctx, iis2dlpc_pp_od_t val);
int32_t iis2dlpc_pin_mode_get(iis2dlpc_ctx_t *ctx, iis2dlpc_pp_od_t *val);

int32_t iis2dlpc_pin_int1_route_set(iis2dlpc_ctx_t *ctx,
                                    iis2dlpc_ctrl4_int1_pad_ctrl_t *val);
int32_t iis2dlpc_pin_int1_route_get(iis2dlpc_ctx_t *ctx,
                                    iis2dlpc_ctrl4_int1_pad_ctrl_t *val);

int32_t iis2dlpc_pin_int2_route_set(iis2dlpc_ctx_t *ctx,
                                    iis2dlpc_ctrl5_int2_pad_ctrl_t *val);
int32_t iis2dlpc_pin_int2_route_get(iis2dlpc_ctx_t *ctx,
                                    iis2dlpc_ctrl5_int2_pad_ctrl_t *val);

int32_t iis2dlpc_all_on_int1_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_all_on_int1_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_wkup_threshold_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_wkup_threshold_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_wkup_dur_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_wkup_dur_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_HP_FEED           = 0,
  IIS2DLPC_USER_OFFSET_FEED  = 1,
} iis2dlpc_usr_off_on_wu_t;
int32_t iis2dlpc_wkup_feed_data_set(iis2dlpc_ctx_t *ctx,
                                    iis2dlpc_usr_off_on_wu_t val);
int32_t iis2dlpc_wkup_feed_data_get(iis2dlpc_ctx_t *ctx,
                                    iis2dlpc_usr_off_on_wu_t *val);

typedef enum {
  IIS2DLPC_NO_DETECTION        = 0,
  IIS2DLPC_DETECT_ACT_INACT    = 1,
  IIS2DLPC_DETECT_STAT_MOTION  = 3,
} iis2dlpc_sleep_on_t;
int32_t iis2dlpc_act_mode_set(iis2dlpc_ctx_t *ctx, iis2dlpc_sleep_on_t val);
int32_t iis2dlpc_act_mode_get(iis2dlpc_ctx_t *ctx, iis2dlpc_sleep_on_t *val);

int32_t iis2dlpc_act_sleep_dur_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_act_sleep_dur_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_threshold_x_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_threshold_x_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_threshold_y_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_threshold_y_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_XYZ    = 0,
  IIS2DLPC_YXZ    = 1,
  IIS2DLPC_XZY    = 2,
  IIS2DLPC_ZYX    = 3,
  IIS2DLPC_YZX    = 5,
  IIS2DLPC_ZXY    = 6,
} iis2dlpc_tap_prior_t;
int32_t iis2dlpc_tap_axis_priority_set(iis2dlpc_ctx_t *ctx,
                                       iis2dlpc_tap_prior_t val);
int32_t iis2dlpc_tap_axis_priority_get(iis2dlpc_ctx_t *ctx,
                                       iis2dlpc_tap_prior_t *val);

int32_t iis2dlpc_tap_threshold_z_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_threshold_z_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_detection_on_z_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_detection_on_z_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_detection_on_y_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_detection_on_y_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_detection_on_x_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_detection_on_x_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_shock_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_shock_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_quiet_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_quiet_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_tap_dur_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_tap_dur_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_ONLY_SINGLE          = 0,
  IIS2DLPC_BOTH_SINGLE_DOUBLE   = 1,
} iis2dlpc_single_double_tap_t;
int32_t iis2dlpc_tap_mode_set(iis2dlpc_ctx_t *ctx,
                              iis2dlpc_single_double_tap_t val);
int32_t iis2dlpc_tap_mode_get(iis2dlpc_ctx_t *ctx,
                              iis2dlpc_single_double_tap_t *val);

int32_t iis2dlpc_tap_src_get(iis2dlpc_ctx_t *ctx, iis2dlpc_tap_src_t *val);

int32_t iis2dlpc_6d_threshold_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_6d_threshold_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_4d_mode_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_4d_mode_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_6d_src_get(iis2dlpc_ctx_t *ctx, iis2dlpc_sixd_src_t *val);

typedef enum {
  IIS2DLPC_ODR_DIV_2_FEED   = 0,
  IIS2DLPC_LPF2_FEED        = 1,
} iis2dlpc_lpass_on6d_t;
int32_t iis2dlpc_6d_feed_data_set(iis2dlpc_ctx_t *ctx,
                                  iis2dlpc_lpass_on6d_t val);
int32_t iis2dlpc_6d_feed_data_get(iis2dlpc_ctx_t *ctx,
                                  iis2dlpc_lpass_on6d_t *val);

int32_t iis2dlpc_ff_dur_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_ff_dur_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_FF_TSH_5LSb_FS2g  = 0,
  IIS2DLPC_FF_TSH_7LSb_FS2g  = 1,
  IIS2DLPC_FF_TSH_8LSb_FS2g  = 2,
  IIS2DLPC_FF_TSH_10LSb_FS2g = 3,
  IIS2DLPC_FF_TSH_11LSb_FS2g = 4,
  IIS2DLPC_FF_TSH_13LSb_FS2g = 5,
  IIS2DLPC_FF_TSH_15LSb_FS2g = 6,
  IIS2DLPC_FF_TSH_16LSb_FS2g = 7,
} iis2dlpc_ff_ths_t;
int32_t iis2dlpc_ff_threshold_set(iis2dlpc_ctx_t *ctx,
                                  iis2dlpc_ff_ths_t val);
int32_t iis2dlpc_ff_threshold_get(iis2dlpc_ctx_t *ctx,
                                  iis2dlpc_ff_ths_t *val);

int32_t iis2dlpc_fifo_watermark_set(iis2dlpc_ctx_t *ctx, uint8_t val);
int32_t iis2dlpc_fifo_watermark_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DLPC_BYPASS_MODE             = 0,
  IIS2DLPC_FIFO_MODE               = 1,
  IIS2DLPC_STREAM_TO_FIFO_MODE     = 3,
  IIS2DLPC_BYPASS_TO_STREAM_MODE   = 4,
  IIS2DLPC_STREAM_MODE             = 6,
} iis2dlpc_fmode_t;
int32_t iis2dlpc_fifo_mode_set(iis2dlpc_ctx_t *ctx, iis2dlpc_fmode_t val);
int32_t iis2dlpc_fifo_mode_get(iis2dlpc_ctx_t *ctx, iis2dlpc_fmode_t *val);

int32_t iis2dlpc_fifo_data_level_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_fifo_ovr_flag_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

int32_t iis2dlpc_fifo_wtm_flag_get(iis2dlpc_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*IIS2DLPC_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
